Revit 2027 API
IFCParameterTemplate.IsPropertySetAMemberOfTemplate Method
 Checks whether a property set exists in the template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPropertySetAMemberOfTemplate(
	PropertySetupType propertySetupType,
	string propertySetName
)
Public Function IsPropertySetAMemberOfTemplate (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As Boolean
public:
bool IsPropertySetAMemberOfTemplate(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
member IsPropertySetAMemberOfTemplate :
        propertySetupType : PropertySetupType *
        propertySetName : string -> bool
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
Return Value
Boolean
 True if the property set exists in the template.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace